# Pandas

<img src="../logos/pandas.png" width="256px" />

In computer programming, pandas is a software library written for the Python programming language for data manipulation and analysis. In particular, it offers data structures and operations for manipulating numerical tables and time series.

* Web: https://pandas.pydata.org/

In [1]:
import numpy as np
import pandas as pd

from numpy.random import randn

np.random.seed(110)

%matplotlib inline

---

## Part I: Series

In [2]:
lst, labels = [10, 20, 30], ['a', 'b', 'c']

arr = np.array(lst)
dic = {'a': 10, 'b': 20, 'c': 30}

In [3]:
pd.Series(data=lst)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=lst, index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(dic)

a    10
b    20
c    30
dtype: int64

In [6]:
series_1 = pd.Series([1, 2, 3, 4], ['USA', 'Germany', 'USSR', 'Japan'])
series_2 = pd.Series([1, 2, 5, 4], ['USA', 'Germany', 'Italy', 'Japan'])

In [7]:
series_1['USA']

1

In [8]:
series_1 + series_2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

---

## Part II: Data Frames

### Creating a Data Frame

In [9]:
df = pd.DataFrame(randn(5, 4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])
df

          W         X         Y         Z
A  0.328597 -0.796199  1.403124 -1.547793
B  1.166730  1.147723  0.130109  0.431422
C -0.868320  0.027159 -1.518739 -0.815561
D -0.223637 -2.631096  0.046867 -0.376922
E -0.162840 -0.744918  1.069300 -0.734714

### Slicing a Data Frame

In [10]:
df['W']

A    0.328597
B    1.166730
C   -0.868320
D   -0.223637
E   -0.162840
Name: W, dtype: float64

In [11]:
df['W']['C']

-0.8683197629930438

In [12]:
type(df)

pandas.core.frame.DataFrame

In [13]:
df.W  # similar to sql, but it is not recommended.

A    0.328597
B    1.166730
C   -0.868320
D   -0.223637
E   -0.162840
Name: W, dtype: float64

In [14]:
df[['W', 'Y']]

          W         Y
A  0.328597  1.403124
B  1.166730  0.130109
C -0.868320 -1.518739
D -0.223637  0.046867
E -0.162840  1.069300

In [15]:
df.loc[['A', 'B']]

          W         X         Y         Z
A  0.328597 -0.796199  1.403124 -1.547793
B  1.166730  1.147723  0.130109  0.431422

In [16]:
df.loc[['C']]

         W         X         Y         Z
C -0.86832  0.027159 -1.518739 -0.815561

In [17]:
df.loc['C']

W   -0.868320
X    0.027159
Y   -1.518739
Z   -0.815561
Name: C, dtype: float64

In [18]:
df.iloc[2]

W   -0.868320
X    0.027159
Y   -1.518739
Z   -0.815561
Name: C, dtype: float64

In [19]:
df.loc[['A', 'B'], ['W', 'Z']]

          W         Z
A  0.328597 -1.547793
B  1.166730  0.431422

### Creating a new column

In [20]:
df['XI'] = df['W'] + df['Y']
df

          W         X         Y         Z        XI
A  0.328597 -0.796199  1.403124 -1.547793  1.731721
B  1.166730  1.147723  0.130109  0.431422  1.296840
C -0.868320  0.027159 -1.518739 -0.815561 -2.387059
D -0.223637 -2.631096  0.046867 -0.376922 -0.176771
E -0.162840 -0.744918  1.069300 -0.734714  0.906460

In [21]:
df['XII'] = ['a', 'b', 'c', 'd', 'e']
df

          W         X         Y         Z        XI XII
A  0.328597 -0.796199  1.403124 -1.547793  1.731721   a
B  1.166730  1.147723  0.130109  0.431422  1.296840   b
C -0.868320  0.027159 -1.518739 -0.815561 -2.387059   c
D -0.223637 -2.631096  0.046867 -0.376922 -0.176771   d
E -0.162840 -0.744918  1.069300 -0.734714  0.906460   e

### Dropping a column

In [22]:
df.drop('XI', axis=1)  # axis = 0 is for row.

          W         X         Y         Z XII
A  0.328597 -0.796199  1.403124 -1.547793   a
B  1.166730  1.147723  0.130109  0.431422   b
C -0.868320  0.027159 -1.518739 -0.815561   c
D -0.223637 -2.631096  0.046867 -0.376922   d
E -0.162840 -0.744918  1.069300 -0.734714   e

In [23]:
df

          W         X         Y         Z        XI XII
A  0.328597 -0.796199  1.403124 -1.547793  1.731721   a
B  1.166730  1.147723  0.130109  0.431422  1.296840   b
C -0.868320  0.027159 -1.518739 -0.815561 -2.387059   c
D -0.223637 -2.631096  0.046867 -0.376922 -0.176771   d
E -0.162840 -0.744918  1.069300 -0.734714  0.906460   e

In [24]:
df.drop('XI', axis=1, inplace=True)
df

          W         X         Y         Z XII
A  0.328597 -0.796199  1.403124 -1.547793   a
B  1.166730  1.147723  0.130109  0.431422   b
C -0.868320  0.027159 -1.518739 -0.815561   c
D -0.223637 -2.631096  0.046867 -0.376922   d
E -0.162840 -0.744918  1.069300 -0.734714   e

In [25]:
df.drop('E', axis=0)  # default value for axis is 0.

          W         X         Y         Z XII
A  0.328597 -0.796199  1.403124 -1.547793   a
B  1.166730  1.147723  0.130109  0.431422   b
C -0.868320  0.027159 -1.518739 -0.815561   c
D -0.223637 -2.631096  0.046867 -0.376922   d

In [26]:
df.shape

(5, 5)

### Conditional Selection

In [27]:
df > 0

       W      X      Y      Z   XII
A   True  False   True  False  True
B   True   True   True   True  True
C  False   True  False  False  True
D  False  False   True  False  True
E  False  False   True  False  True

In [28]:
bool_df = df > 0
bool_df

       W      X      Y      Z   XII
A   True  False   True  False  True
B   True   True   True   True  True
C  False   True  False  False  True
D  False  False   True  False  True
E  False  False   True  False  True

In [29]:
df[bool_df]

          W         X         Y         Z XII
A  0.328597       NaN  1.403124       NaN   a
B  1.166730  1.147723  0.130109  0.431422   b
C       NaN  0.027159       NaN       NaN   c
D       NaN       NaN  0.046867       NaN   d
E       NaN       NaN  1.069300       NaN   e

In [30]:
df[df > 0]

          W         X         Y         Z XII
A  0.328597       NaN  1.403124       NaN   a
B  1.166730  1.147723  0.130109  0.431422   b
C       NaN  0.027159       NaN       NaN   c
D       NaN       NaN  0.046867       NaN   d
E       NaN       NaN  1.069300       NaN   e

In [31]:
df['W'] > 0

A     True
B     True
C    False
D    False
E    False
Name: W, dtype: bool

In [32]:
df[df['W'] > 0]

          W         X         Y         Z XII
A  0.328597 -0.796199  1.403124 -1.547793   a
B  1.166730  1.147723  0.130109  0.431422   b

In [33]:
df[df['Z'] < 0]

          W         X         Y         Z XII
A  0.328597 -0.796199  1.403124 -1.547793   a
C -0.868320  0.027159 -1.518739 -0.815561   c
D -0.223637 -2.631096  0.046867 -0.376922   d
E -0.162840 -0.744918  1.069300 -0.734714   e

In [34]:
res_df = df[df['W'] > 0]
res_df

          W         X         Y         Z XII
A  0.328597 -0.796199  1.403124 -1.547793   a
B  1.166730  1.147723  0.130109  0.431422   b

In [35]:
res_df['X']

A   -0.796199
B    1.147723
Name: X, dtype: float64

df[(df['W'] > 0) and (df['Y'] > 1)]

In [36]:
df[(df['W'] > 0) & (df['Y'] > 1)]  # Use '&' for AND

          W         X         Y         Z XII
A  0.328597 -0.796199  1.403124 -1.547793   a

In [37]:
df[(df['W'] > 0) | (df['Y'] > 1)]  # Use '|' for OR

          W         X         Y         Z XII
A  0.328597 -0.796199  1.403124 -1.547793   a
B  1.166730  1.147723  0.130109  0.431422   b
E -0.162840 -0.744918  1.069300 -0.734714   e

In [38]:
df.reset_index()  # you may set the 'inplace' argument

  index         W         X         Y         Z XII
0     A  0.328597 -0.796199  1.403124 -1.547793   a
1     B  1.166730  1.147723  0.130109  0.431422   b
2     C -0.868320  0.027159 -1.518739 -0.815561   c
3     D -0.223637 -2.631096  0.046867 -0.376922   d
4     E -0.162840 -0.744918  1.069300 -0.734714   e

In [39]:
newind = 'CA NY WY OR CO'.split()
df['States'] = newind
df

          W         X         Y         Z XII States
A  0.328597 -0.796199  1.403124 -1.547793   a     CA
B  1.166730  1.147723  0.130109  0.431422   b     NY
C -0.868320  0.027159 -1.518739 -0.815561   c     WY
D -0.223637 -2.631096  0.046867 -0.376922   d     OR
E -0.162840 -0.744918  1.069300 -0.734714   e     CO

In [40]:
df.set_index('States')

               W         X         Y         Z XII
States
CA      0.328597 -0.796199  1.403124 -1.547793   a
NY      1.166730  1.147723  0.130109  0.431422   b
WY     -0.868320  0.027159 -1.518739 -0.815561   c
OR     -0.223637 -2.631096  0.046867 -0.376922   d
CO     -0.162840 -0.744918  1.069300 -0.734714   e

### Multi-level Indexing

In [41]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [42]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [43]:
df = pd.DataFrame(randn(6, 2), hier_index, ['A', 'B'])
df

             A         B
G1 1 -1.467635  1.794009
   2 -1.661406 -0.058978
   3  0.243002  1.578052
G2 1  1.566281 -1.243515
   2  0.537586 -0.843777
   3  0.104712 -0.481808

In [44]:
df.loc['G1'].loc[1]

A   -1.467635
B    1.794009
Name: 1, dtype: float64

In [45]:
df.index.names = ['Groups', 'Numbers']
df

                       A         B
Groups Numbers
G1     1       -1.467635  1.794009
       2       -1.661406 -0.058978
       3        0.243002  1.578052
G2     1        1.566281 -1.243515
       2        0.537586 -0.843777
       3        0.104712 -0.481808

In [46]:
df.xs('G1')

                A         B
Numbers
1       -1.467635  1.794009
2       -1.661406 -0.058978
3        0.243002  1.578052

In [47]:
df.xs(1, level='Numbers')

               A         B
Groups
G1     -1.467635  1.794009
G2      1.566281 -1.243515

### Handling Missing Values

In [48]:
d = {'A':[1, 2, np.nan], 'B':[5, np.nan, np.nan], 'C':[1, 2, 3]}

df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [49]:
# dropna drops any rows holding a NaN value.
df.dropna()

     A    B  C
0  1.0  5.0  1

In [50]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [51]:
df.dropna(thresh=2)  # at least have two NaN values.

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [52]:
df['A'].fillna(value=df['A'].min())

0    1.0
1    2.0
2    1.0
Name: A, dtype: float64

In [53]:
d = {'A':[1, 2, np.nan], 'B':[5, np.nan, np.nan], 'C':[1, 2, 3]}

df = pd.DataFrame(d)
df

# dropna drops any rows holding a NaN value.
df.dropna()

df.dropna(axis=1)

df.dropna(thresh=2)  # at least have two NaN values.

df['A'].fillna(value=df['A'].min())

0    1.0
1    2.0
2    1.0
Name: A, dtype: float64

---

## Part III: Group By

* Groupby allows you to group together rows based off of a column and perform an aggregate function on them.

In [54]:
data = {'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'], 
        'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'], 
        'Sales': [200, 120, 340, 124, 243, 350]}

In [55]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [56]:
by_company = df.groupby('Company')
by_company

In [57]:
# Pandas automatically ignores non-numeric columns
by_company.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [58]:
by_company.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [59]:
by_company.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [60]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [61]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [62]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [63]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

## Part IV: Joining and Concatenating

### Concatenating

In [64]:
df_1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 'B': ['B0', 'B1', 'B2', 'B3'],
                     'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']},
                    index=[0, 1, 2, 3])

In [65]:
df_2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'], 'B': ['B4', 'B5', 'B6', 'B7'],
                     'C': ['C4', 'C5', 'C6', 'C7'], 'D': ['D4', 'D5', 'D6', 'D7']},
                    index=[4, 5, 6, 7])

In [66]:
df_3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'], 'B': ['B8', 'B9', 'B10', 'B11'],
                     'C': ['C8', 'C9', 'C10', 'C11'], 'D': ['D8', 'D9', 'D10', 'D11']},
                    index=[8, 9, 10, 11])

In [67]:
pd.concat([df_1, df_2, df_3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [68]:
pd.concat([df_1, df_2, df_3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

The NaN values are because there are no values for the indices in original data frames.

### Merging

It merges two data frames with respect to given shared columns' names.

In [69]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'], 
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']}, index=[0, 1, 2, 3])
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']}, index=[0, 1, 2, 3])

In [70]:
pd.merge(left, right, how='inner', on='key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [71]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})

In [72]:
pd.merge(left, right, how='inner', on=['key1', 'key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

In [73]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

     A    B key1 key2    C    D
0   A0   B0   K0   K0   C0   D0
1   A1   B1   K0   K1  NaN  NaN
2   A2   B2   K1   K0   C1   D1
3   A2   B2   K1   K0   C2   D2
4   A3   B3   K2   K1  NaN  NaN
5  NaN  NaN   K2   K0   C3   D3

In [74]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

     A    B key1 key2   C   D
0   A0   B0   K0   K0  C0  D0
1   A2   B2   K1   K0  C1  D1
2   A2   B2   K1   K0  C2  D2
3  NaN  NaN   K2   K0  C3  D3

In [75]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

    A   B key1 key2    C    D
0  A0  B0   K0   K0   C0   D0
1  A1  B1   K0   K1  NaN  NaN
2  A2  B2   K1   K0   C1   D1
3  A2  B2   K1   K0   C2   D2
4  A3  B3   K2   K1  NaN  NaN

### Joining

It joins two data frames based on the "**indices**".

In [76]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                      'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [77]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [78]:
right.join(left)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [79]:
right.join(left, how='outer')

      C    D    A    B
K0   C0   D0   A0   B0
K1  NaN  NaN   A1   B1
K2   C2   D2   A2   B2
K3   C3   D3  NaN  NaN

---

## Part V: Operations

In [80]:
df = pd.DataFrame({'col_1': [1, 2, 3, 4], 
                   'col_2': [444, 555, 666, 444], 
                   'col_3': ['abc', 'def', 'ghi', 'xyz']})

df.head()

   col_1  col_2 col_3
0      1    444   abc
1      2    555   def
2      3    666   ghi
3      4    444   xyz

### Unique

Finding unique values in a data frame:

In [81]:
df['col_2'].unique()

array([444, 555, 666])

Finding the number of unique values in a data frame:

In [82]:
df['col_2'].nunique()

3

In [83]:
df['col_2'].value_counts()

444    2
555    1
666    1
Name: col_2, dtype: int64

### conditional selection

In [84]:
df['col_1'] > 2

0    False
1    False
2     True
3     True
Name: col_1, dtype: bool

In [85]:
df[df['col_1'] > 2]

   col_1  col_2 col_3
2      3    666   ghi
3      4    444   xyz

In [86]:
df[(df['col_1'] > 2) & (df['col_2'] == 444)]

   col_1  col_2 col_3
3      4    444   xyz

### Apply functions

In [87]:
def times_2(x):
    return x * 2

In [88]:
df['col_1'].apply(times_2)

0    2
1    4
2    6
3    8
Name: col_1, dtype: int64

In [89]:
df['col_3'].apply(len)

0    3
1    3
2    3
3    3
Name: col_3, dtype: int64

In [90]:
df['col_2'].apply(lambda x: x * 2)

0     888
1    1110
2    1332
3     888
Name: col_2, dtype: int64

In [91]:
df.drop('col_1', axis=1)  # you may use the 'inplace' aurgument

   col_2 col_3
0    444   abc
1    555   def
2    666   ghi
3    444   xyz

In [92]:
df

   col_1  col_2 col_3
0      1    444   abc
1      2    555   def
2      3    666   ghi
3      4    444   xyz

In [93]:
df.columns

Index(['col_1', 'col_2', 'col_3'], dtype='object')

In [94]:
df.index

RangeIndex(start=0, stop=4, step=1)

### Sorting and Ordering a Data Frame

In [95]:
df.sort_values(by='col_2')

   col_1  col_2 col_3
0      1    444   abc
3      4    444   xyz
1      2    555   def
2      3    666   ghi

### Null values

In [96]:
df.isnull()

   col_1  col_2  col_3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

### Pivot Tables

In [97]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
        'B':['one','one','two','two','one','one'],
        'C':['x','y','x','y','x','y'],
        'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [98]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

---

## Part VI: Data Input and Output

* CSV
* Excel
* HTML
* SQL

In [99]:
pwd

'/home/ali/projects/quick-tutorial-on-data-science/part_2_data_science'

### CSV File

In [100]:
pd.read_csv('../datasets/example.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [101]:
df = pd.read_csv('../datasets/example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [102]:
df.to_csv('../datasets/example_new.csv', index=False)

### Excel File

In [103]:
pd.read_excel('../datasets/Excel_Sample.xlsx', sheetname='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

Be careful you have to use the 'sheet_name', but not 'sheetname'.

In [104]:
df.to_excel('../datasets/Excel_Sample_new.xlsx', sheet_name='NewSheet')

### HTML

In [105]:
html_data = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')
type(html_data)

list

Pandas tries to find all tables in the html file, and put them in a list.

In [106]:
html_data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 21, 2018"
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","July 26, 2017"
3,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"
4,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","December 5, 2017"

### SQL

In [107]:
from sqlalchemy import create_engine

In [108]:
connector = create_engine('sqlite:///:memory:')

In [109]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [110]:
df.to_sql('my_table', connector)

In [111]:
sql_df = pd.read_sql('my_table', connector)

In [112]:
sql_df

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15

---

## Part VII: Plotting